网络互联基础
============================================================

OSI（Open Systems Interconnection，开放系统互联）
语计算机语言指的是二进制编码(由 0 或 1 组成)

### 栗子一

 [![你看不见我哦~](https://camo.githubusercontent.com/73c74b09f8bfbf244473d267f3e2c93bca54e685/68747470733a2f2f692e696d6775722e636f6d2f384658364c67312e706e67)][1] 

这是一个使用集线器连接的基本 LAN 网络，它实际上只有一个冲突域和一个广播域。

这两台主机使用硬件地址 (MAC地址)进行通信。Bob 如何获悉 Sally 的 MAC 地址呢?

这两台主机位于同一个 LAN 中， Bob 只需发送一个数据链路层广播来获取 Sally 的 MAC 地址，使用 ARP (Address Resolution Protocol ，地址解析协议)。

ARP请求

```
Source    Destination Protocol Info 
192.168.0.2 Broadcast  ARP  Who has 192.168.0.3? Tell 192.168.0.2

```

ARP应答

```
Source    Destination Protocol Info 
192.168.0.3 192.168.0.2 ARP 192.168.0.3 is at 00:Ob:db:99:d3:5e 

```

随着网络的增大，用户响应将非常缓慢，而 LAN 数据流将发生严重拥塞。

对于这种问题，解决之道是将大型网络划分成众多小网络，这称为网络分段( network segmentation )。为此，可使用路由器、交换机和网桥等设备。

### 栗子二

 [![你看不见我哦~](https://camo.githubusercontent.com/f4c8b04ac43747cc36ee3be476cb4654731bef8e/68747470733a2f2f692e696d6775722e636f6d2f7977464a3350562e706e67)][2] 

我们使用交换机对网络进行了分段，让与交换机连接的每个网段都成为了一个独立的冲突域。但需要
注意的是，这个网络仍只有一个广播域。

集线器不能将网络分段（隔离冲突域），这里把它作为扩展交换机端口连接的冲突域。

导致 LAN 拥塞的常见原因如下:

*   同一个广播域或冲突域中的主机太多（使用集线器扩展网络）。

*   广播风暴

*   组播数据流太多

*   带宽太低

路由器用于连接多个网络，并在网络之间路由数据分组。
默认情况下，路由器将广播域划分成多个。广播域( broadcast domain )指的是同一个网段中所有设备组成的集合，这些设备侦听该网段中发送的所有广播。

### 栗子三

 [![你看不见我哦~](https://camo.githubusercontent.com/9f412179d4a27c30a6e7887aa22f5b0559f649de/68747470733a2f2f692e696d6775722e636f6d2f616631396e32492e706e67)][3] 

每台主机都位于一个独立的冲突域中，而路由器将网络划分成了两个广播域。另外，该路由器使用串行接口提供了 WAN 服务的连接。

一台主机或服务器发送网络广播时，网络中的所有设备都必须读取并处理这一广播，路由器除外，它在接口收到广播后，将广播丢弃，不将其转发给其他网络。

路由器默认对广播域进行分割，也对冲突域进行分割。

在网络中，路由器有如下功能:

*   分组交换，根据访问控制列表规则通信？

*   分组过滤（根据网络层信息(如 IP 地址)对网络进行过滤），访问控制列表？

*   网络间通信

*   路径选择（根据路由表）

路由器实际上是三层交换机，使用逻辑地址，并提供分组交换功能，还可使用访问列表进行分组过滤。

默认情况下，交换机不对广播域进行分割，主要用途是让 LAN 更好地运行一一优化其性能，向 LAN 用户提供更高的带宽。

路由器将分组转发到其他网络，而交换机只在交换型网络内的端口之间交换帧。

默认情况下，交换机对冲突域( collision domain) 进行分割。
指的是这样一种网络情形:某台设备在网络上发送分组时，当前网段中的其他所有设备都必须注意到这一点。如果同时有两台设备试图传输数据，将导致冲突，而这两台设备必须分别重传数据，因此效率不高!

这种情形通常出现在使用集线器的网络环境中一一与某个集线器相连的所有主机都属于同一个冲突域

交换机创建多个冲突域，但只创建一个广播域，而路由器为每个接口都提供不同的广播域。

网桥和交换机的基本功能相同，都将 LAN 划分成多个冲突域。

在网络中使用网桥可减少广播域中的冲突，并增加网络中的冲突域。这样做将给用户提供更高的带宽。

使用集线器可能使以太网更拥堵。

### 栗子四

 [![你看不见我哦~](https://camo.githubusercontent.com/efa6a42c4b1827c9dae37d6b4f0121f2064bb7c9/68747470733a2f2f692e696d6775722e636f6d2f424a6f6a6862352e706e67)][4] 

使用路由器时，不仅可使每个 LAN 接口都属于一个独立的广播域，它还将分割冲突域。

网桥对冲突域进行分割，但同时连接到两台集线器的所有主机都属于同一个广播域。另外，该网桥只创建了两个冲突域，因此连接到同一个集线器的所有设备都属于同一个冲突域。

底部 3 台彼此相连的集线器连接到了路由器，它们组成了一个冲突域和一个广播域。

有 9 个冲突域和 3 广播域呢。

虽然网桥/交换机用于将网络分段，但它们不能隔离广播和组播分组。

广播域太大时，用户可用的带宽就很少，必须处理的广播就很多，而网络的响应速度将会变慢。

### 栗子五

 [![你看不见我哦~](https://camo.githubusercontent.com/345dda6927feedcd138ffaeee599349c424f9804/68747470733a2f2f692e696d6775722e636f6d2f773863716273362e706e67)][5] 

以 LAN 交换机为核心建立网络，因此路由器连接的只是逻辑网络。采用这种配置时，我们便创建虚拟 LAN (VLAN)。

即使组建了交换型网络，仍需使用路由器(三层交换机)进行 VLAN 间通信。

每个交换机端口对应一个冲突域，而每个 VLAN 对应一个独立的广播域。仍需要一台路由器，以便在 VLAN 之间进行路由选择。

有 10 个冲突域

--------------------------------------------------------------------------------


[a]:
[1]:https://camo.githubusercontent.com/73c74b09f8bfbf244473d267f3e2c93bca54e685/68747470733a2f2f692e696d6775722e636f6d2f384658364c67312e706e67
[2]:https://camo.githubusercontent.com/f4c8b04ac43747cc36ee3be476cb4654731bef8e/68747470733a2f2f692e696d6775722e636f6d2f7977464a3350562e706e67
[3]:https://camo.githubusercontent.com/9f412179d4a27c30a6e7887aa22f5b0559f649de/68747470733a2f2f692e696d6775722e636f6d2f616631396e32492e706e67
[4]:https://camo.githubusercontent.com/efa6a42c4b1827c9dae37d6b4f0121f2064bb7c9/68747470733a2f2f692e696d6775722e636f6d2f424a6f6a6862352e706e67
[5]:https://camo.githubusercontent.com/345dda6927feedcd138ffaeee599349c424f9804/68747470733a2f2f692e696d6775722e636f6d2f773863716273362e706e67
